MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz8110ca9/thirdparty/pic32cz8110ca9/component/sqi.h
/* -------- SQI_INTSTAT : (SQI Offset: 0x120) (R/W 32) SPI Interrupt Status Register -------- */
#define SQI_INTSTAT_RESETVALUE                _UINT32_(0xAD)                                       /*  (SQI_INTSTAT) SPI Interrupt Status Register  Reset Value */

#define SQI_INTSTAT_TXEMPTYIF_Pos             _UINT32_(0)                                          /* (SQI_INTSTAT) TX FIFO Empty Interrupt. Position */
#define SQI_INTSTAT_TXEMPTYIF_Msk             (_UINT32_(0x1) << SQI_INTSTAT_TXEMPTYIF_Pos)         /* (SQI_INTSTAT) TX FIFO Empty Interrupt. Mask */
#define SQI_INTSTAT_TXEMPTYIF(value)          (SQI_INTSTAT_TXEMPTYIF_Msk & (_UINT32_(value) << SQI_INTSTAT_TXEMPTYIF_Pos)) /* Assignment of value for TXEMPTYIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_TXFULLIF_Pos              _UINT32_(1)                                          /* (SQI_INTSTAT) TX FIFO Full Interrupt. Position */
#define SQI_INTSTAT_TXFULLIF_Msk              (_UINT32_(0x1) << SQI_INTSTAT_TXFULLIF_Pos)          /* (SQI_INTSTAT) TX FIFO Full Interrupt. Mask */
#define SQI_INTSTAT_TXFULLIF(value)           (SQI_INTSTAT_TXFULLIF_Msk & (_UINT32_(value) << SQI_INTSTAT_TXFULLIF_Pos)) /* Assignment of value for TXFULLIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_TXTHRIF_Pos               _UINT32_(2)                                          /* (SQI_INTSTAT) Interrupt to be generated when the TX FIFO has space equal to or more than  TX_INT_THRES words. Position */
#define SQI_INTSTAT_TXTHRIF_Msk               (_UINT32_(0x1) << SQI_INTSTAT_TXTHRIF_Pos)           /* (SQI_INTSTAT) Interrupt to be generated when the TX FIFO has space equal to or more than  TX_INT_THRES words. Mask */
#define SQI_INTSTAT_TXTHRIF(value)            (SQI_INTSTAT_TXTHRIF_Msk & (_UINT32_(value) << SQI_INTSTAT_TXTHRIF_Pos)) /* Assignment of value for TXTHRIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_RXEMPTYIF_Pos             _UINT32_(3)                                          /* (SQI_INTSTAT) RX FIFO Empty Interrupt. Position */
#define SQI_INTSTAT_RXEMPTYIF_Msk             (_UINT32_(0x1) << SQI_INTSTAT_RXEMPTYIF_Pos)         /* (SQI_INTSTAT) RX FIFO Empty Interrupt. Mask */
#define SQI_INTSTAT_RXEMPTYIF(value)          (SQI_INTSTAT_RXEMPTYIF_Msk & (_UINT32_(value) << SQI_INTSTAT_RXEMPTYIF_Pos)) /* Assignment of value for RXEMPTYIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_RXFULLIF_Pos              _UINT32_(4)                                          /* (SQI_INTSTAT) RX FIFO Full Interrupt. Position */
#define SQI_INTSTAT_RXFULLIF_Msk              (_UINT32_(0x1) << SQI_INTSTAT_RXFULLIF_Pos)          /* (SQI_INTSTAT) RX FIFO Full Interrupt. Mask */
#define SQI_INTSTAT_RXFULLIF(value)           (SQI_INTSTAT_RXFULLIF_Msk & (_UINT32_(value) << SQI_INTSTAT_RXFULLIF_Pos)) /* Assignment of value for RXFULLIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_RXTHRIF_Pos               _UINT32_(5)                                          /* (SQI_INTSTAT) Interrupt to be generated when the RX FIFO has data more than or equal to  RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus. Position */
#define SQI_INTSTAT_RXTHRIF_Msk               (_UINT32_(0x1) << SQI_INTSTAT_RXTHRIF_Pos)           /* (SQI_INTSTAT) Interrupt to be generated when the RX FIFO has data more than or equal to  RX_INT_THRES words. In case of Boot/XIP mode, the power on reset value of RX buffer threshold is zero. So this bit will be set to 1, immediately after power on reset, till a read request on the AHB Bus. Mask */
#define SQI_INTSTAT_RXTHRIF(value)            (SQI_INTSTAT_RXTHRIF_Msk & (_UINT32_(value) << SQI_INTSTAT_RXTHRIF_Pos)) /* Assignment of value for RXTHRIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_CONFULLIF_Pos             _UINT32_(6)                                          /* (SQI_INTSTAT) Control Buffer Full Interrupt Position */
#define SQI_INTSTAT_CONFULLIF_Msk             (_UINT32_(0x1) << SQI_INTSTAT_CONFULLIF_Pos)         /* (SQI_INTSTAT) Control Buffer Full Interrupt Mask */
#define SQI_INTSTAT_CONFULLIF(value)          (SQI_INTSTAT_CONFULLIF_Msk & (_UINT32_(value) << SQI_INTSTAT_CONFULLIF_Pos)) /* Assignment of value for CONFULLIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_CONEMPTYIF_Pos            _UINT32_(7)                                          /* (SQI_INTSTAT) Control Buffer Empty Interrupt Position */
#define SQI_INTSTAT_CONEMPTYIF_Msk            (_UINT32_(0x1) << SQI_INTSTAT_CONEMPTYIF_Pos)        /* (SQI_INTSTAT) Control Buffer Empty Interrupt Mask */
#define SQI_INTSTAT_CONEMPTYIF(value)         (SQI_INTSTAT_CONEMPTYIF_Msk & (_UINT32_(value) << SQI_INTSTAT_CONEMPTYIF_Pos)) /* Assignment of value for CONEMPTYIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_CONTHRIF_Pos              _UINT32_(8)                                          /* (SQI_INTSTAT) Control Buffer Threshold Interrupt Position */
#define SQI_INTSTAT_CONTHRIF_Msk              (_UINT32_(0x1) << SQI_INTSTAT_CONTHRIF_Pos)          /* (SQI_INTSTAT) Control Buffer Threshold Interrupt Mask */
#define SQI_INTSTAT_CONTHRIF(value)           (SQI_INTSTAT_CONTHRIF_Msk & (_UINT32_(value) << SQI_INTSTAT_CONTHRIF_Pos)) /* Assignment of value for CONTHRIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_BDDONEIF_Pos              _UINT32_(9)                                          /* (SQI_INTSTAT) BDP sets this bit to '1' after current buffer descriptor is processed Position */
#define SQI_INTSTAT_BDDONEIF_Msk              (_UINT32_(0x1) << SQI_INTSTAT_BDDONEIF_Pos)          /* (SQI_INTSTAT) BDP sets this bit to '1' after current buffer descriptor is processed Mask */
#define SQI_INTSTAT_BDDONEIF(value)           (SQI_INTSTAT_BDDONEIF_Msk & (_UINT32_(value) << SQI_INTSTAT_BDDONEIF_Pos)) /* Assignment of value for BDDONEIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_PKTCOMPIF_Pos             _UINT32_(10)                                         /* (SQI_INTSTAT) Packet completion Interrupt Position */
#define SQI_INTSTAT_PKTCOMPIF_Msk             (_UINT32_(0x1) << SQI_INTSTAT_PKTCOMPIF_Pos)         /* (SQI_INTSTAT) Packet completion Interrupt Mask */
#define SQI_INTSTAT_PKTCOMPIF(value)          (SQI_INTSTAT_PKTCOMPIF_Msk & (_UINT32_(value) << SQI_INTSTAT_PKTCOMPIF_Pos)) /* Assignment of value for PKTCOMPIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_DMAEIF_Pos                _UINT32_(11)                                         /* (SQI_INTSTAT) Master Error Interrupt Position */
#define SQI_INTSTAT_DMAEIF_Msk                (_UINT32_(0x1) << SQI_INTSTAT_DMAEIF_Pos)            /* (SQI_INTSTAT) Master Error Interrupt Mask */
#define SQI_INTSTAT_DMAEIF(value)             (SQI_INTSTAT_DMAEIF_Msk & (_UINT32_(value) << SQI_INTSTAT_DMAEIF_Pos)) /* Assignment of value for DMAEIF in the SQI_INTSTAT register */
#define SQI_INTSTAT_Msk                       _UINT32_(0x00000FFF)                                 /* (SQI_INTSTAT) Register Mask  */


/* -------- SQI_TXDATA : (SQI Offset: 0x124) (R/W 32) SPI Transmit Data Register -------- */
#define SQI_TXDATA_RESETVALUE                 _UINT32_(0x00)                                       /*  (SQI_TXDATA) SPI Transmit Data Register  Reset Value */

#define SQI_TXDATA_TXDATA_Pos                 _UINT32_(0)                                          /* (SQI_TXDATA) Data is loaded into this register before being transmitted. Just prior to the beginning of a data transfer, the data in TX_DATA is loaded into the shift register. This register is  used as a window to write data into Transmit buffer. Position */
#define SQI_TXDATA_TXDATA_Msk                 (_UINT32_(0xFFFFFFFF) << SQI_TXDATA_TXDATA_Pos)      /* (SQI_TXDATA) Data is loaded into this register before being transmitted. Just prior to the beginning of a data transfer, the data in TX_DATA is loaded into the shift register. This register is  used as a window to write data into Transmit buffer. Mask */
#define SQI_TXDATA_TXDATA(value)              (SQI_TXDATA_TXDATA_Msk & (_UINT32_(value) << SQI_TXDATA_TXDATA_Pos)) /* Assignment of value for TXDATA in the SQI_TXDATA register */
#define SQI_TXDATA_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SQI_TXDATA) Register Mask  */


/* -------- SQI_RXDATA : (SQI Offset: 0x128) ( R/ 32) SPI Receive Data Register -------- */
#define SQI_RXDATA_RESETVALUE                 _UINT32_(0x00)                                       /*  (SQI_RXDATA) SPI Receive Data Register  Reset Value */

#define SQI_RXDATA_RXDATA_Pos                 _UINT32_(0)                                          /* (SQI_RXDATA) At the end of a data transfer, the data in the shift register is loaded into RX_DATA register. This register is used as a window to read data from Receive buffer. Position */
#define SQI_RXDATA_RXDATA_Msk                 (_UINT32_(0xFFFFFFFF) << SQI_RXDATA_RXDATA_Pos)      /* (SQI_RXDATA) At the end of a data transfer, the data in the shift register is loaded into RX_DATA register. This register is used as a window to read data from Receive buffer. Mask */
#define SQI_RXDATA_RXDATA(value)              (SQI_RXDATA_RXDATA_Msk & (_UINT32_(value) << SQI_RXDATA_RXDATA_Pos)) /* Assignment of value for RXDATA in the SQI_RXDATA register */
#define SQI_RXDATA_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SQI_RXDATA) Register Mask  */


/* -------- SQI_STAT1 : (SQI Offset: 0x12C) ( R/ 32) SPI Status1 Register -------- */
#define SQI_STAT1_RESETVALUE                  _UINT32_(0x1000000)                                  /*  (SQI_STAT1) SPI Status1 Register  Reset Value */

#define SQI_STAT1_RXBUFCNT_Pos                _UINT32_(0)                                          /* (SQI_STAT1) Number of Words of Read Data in the FIFO. Position */
#define SQI_STAT1_RXBUFCNT_Msk                (_UINT32_(0xFFFF) << SQI_STAT1_RXBUFCNT_Pos)         /* (SQI_STAT1) Number of Words of Read Data in the FIFO. Mask */
#define SQI_STAT1_RXBUFCNT(value)             (SQI_STAT1_RXBUFCNT_Msk & (_UINT32_(value) << SQI_STAT1_RXBUFCNT_Pos)) /* Assignment of value for RXBUFCNT in the SQI_STAT1 register */
#define SQI_STAT1_TXBUFFREE_Pos               _UINT32_(16)                                         /* (SQI_STAT1) Number of Words of Space available in the TX FIFO. Max value equals value of MEM_SIZE_BYTES parameter. Default value is Max Position */
#define SQI_STAT1_TXBUFFREE_Msk               (_UINT32_(0xFFFF) << SQI_STAT1_TXBUFFREE_Pos)        /* (SQI_STAT1) Number of Words of Space available in the TX FIFO. Max value equals value of MEM_SIZE_BYTES parameter. Default value is Max Mask */
#define SQI_STAT1_TXBUFFREE(value)            (SQI_STAT1_TXBUFFREE_Msk & (_UINT32_(value) << SQI_STAT1_TXBUFFREE_Pos)) /* Assignment of value for TXBUFFREE in the SQI_STAT1 register */
#define SQI_STAT1_Msk                         _UINT32_(0xFFFFFFFF)                                 /* (SQI_STAT1) Register Mask  */


