MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz8110ca9/thirdparty/pic32cz8110ca9/component/sqi.h
#define SQI_XCON3_INIT1CMD1_Pos               _UINT32_(0)                                          /* (SQI_XCON3) 8bit SPI Init1 Code1 value. Position */
#define SQI_XCON3_INIT1CMD1_Msk               (_UINT32_(0xFF) << SQI_XCON3_INIT1CMD1_Pos)          /* (SQI_XCON3) 8bit SPI Init1 Code1 value. Mask */
#define SQI_XCON3_INIT1CMD1(value)            (SQI_XCON3_INIT1CMD1_Msk & (_UINT32_(value) << SQI_XCON3_INIT1CMD1_Pos)) /* Assignment of value for INIT1CMD1 in the SQI_XCON3 register */
#define SQI_XCON3_INIT1CMD2_Pos               _UINT32_(8)                                          /* (SQI_XCON3) 8bit SPI Init1 Code2 value. Position */
#define SQI_XCON3_INIT1CMD2_Msk               (_UINT32_(0xFF) << SQI_XCON3_INIT1CMD2_Pos)          /* (SQI_XCON3) 8bit SPI Init1 Code2 value. Mask */
#define SQI_XCON3_INIT1CMD2(value)            (SQI_XCON3_INIT1CMD2_Msk & (_UINT32_(value) << SQI_XCON3_INIT1CMD2_Pos)) /* Assignment of value for INIT1CMD2 in the SQI_XCON3 register */
#define SQI_XCON3_INIT1CMD3_Pos               _UINT32_(16)                                         /* (SQI_XCON3) 8bit SPI Init1 Code3 value. Position */
#define SQI_XCON3_INIT1CMD3_Msk               (_UINT32_(0xFF) << SQI_XCON3_INIT1CMD3_Pos)          /* (SQI_XCON3) 8bit SPI Init1 Code3 value. Mask */
#define SQI_XCON3_INIT1CMD3(value)            (SQI_XCON3_INIT1CMD3_Msk & (_UINT32_(value) << SQI_XCON3_INIT1CMD3_Pos)) /* Assignment of value for INIT1CMD3 in the SQI_XCON3 register */
#define SQI_XCON3_INIT1TYPE_Pos               _UINT32_(24)                                         /* (SQI_XCON3) SPI TYPE  INIT1: 00 - Single lane mode , 01 - Dual lane mode , 10 - Quad lane mode , 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT1 Code in 1/2/4 lane. Position */
#define SQI_XCON3_INIT1TYPE_Msk               (_UINT32_(0x3) << SQI_XCON3_INIT1TYPE_Pos)           /* (SQI_XCON3) SPI TYPE  INIT1: 00 - Single lane mode , 01 - Dual lane mode , 10 - Quad lane mode , 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT1 Code in 1/2/4 lane. Mask */
#define SQI_XCON3_INIT1TYPE(value)            (SQI_XCON3_INIT1TYPE_Msk & (_UINT32_(value) << SQI_XCON3_INIT1TYPE_Pos)) /* Assignment of value for INIT1TYPE in the SQI_XCON3 register */
#define SQI_XCON3_INIT1COUNT_Pos              _UINT32_(26)                                         /* (SQI_XCON3) 2bit SPI INIT1 Count. Indicates whether 1, 2 or 3 bytes of INIT1 Code value are being sent. Position */
#define SQI_XCON3_INIT1COUNT_Msk              (_UINT32_(0x3) << SQI_XCON3_INIT1COUNT_Pos)          /* (SQI_XCON3) 2bit SPI INIT1 Count. Indicates whether 1, 2 or 3 bytes of INIT1 Code value are being sent. Mask */
#define SQI_XCON3_INIT1COUNT(value)           (SQI_XCON3_INIT1COUNT_Msk & (_UINT32_(value) << SQI_XCON3_INIT1COUNT_Pos)) /* Assignment of value for INIT1COUNT in the SQI_XCON3 register */
#define SQI_XCON3_INIT1SCHECK_Pos             _UINT32_(28)                                         /* (SQI_XCON3) SPI Init1 Status Check: 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status Control Reg (@0x60) Position */
#define SQI_XCON3_INIT1SCHECK_Msk             (_UINT32_(0x1) << SQI_XCON3_INIT1SCHECK_Pos)         /* (SQI_XCON3) SPI Init1 Status Check: 0 - do not check status, 1 - check status. If this bit is set to 1, the hardware will issue the status command automatically after the current operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status Control Reg (@0x60) Mask */
#define SQI_XCON3_INIT1SCHECK(value)          (SQI_XCON3_INIT1SCHECK_Msk & (_UINT32_(value) << SQI_XCON3_INIT1SCHECK_Pos)) /* Assignment of value for INIT1SCHECK in the SQI_XCON3 register */
#define SQI_XCON3_Msk                         _UINT32_(0x1FFFFFFF)                                 /* (SQI_XCON3) Register Mask  */


/* -------- SQI_XCON4 : (SQI Offset: 0x168) (R/W 32) SPI XIP Control4 Register -------- */
#define SQI_XCON4_RESETVALUE                  _UINT32_(0x00)                                       /*  (SQI_XCON4) SPI XIP Control4 Register  Reset Value */

#define SQI_XCON4_INIT2CMD1_Pos               _UINT32_(0)                                          /* (SQI_XCON4) 8bit SPI Init2 Code1 value. Position */
#define SQI_XCON4_INIT2CMD1_Msk               (_UINT32_(0xFF) << SQI_XCON4_INIT2CMD1_Pos)          /* (SQI_XCON4) 8bit SPI Init2 Code1 value. Mask */
#define SQI_XCON4_INIT2CMD1(value)            (SQI_XCON4_INIT2CMD1_Msk & (_UINT32_(value) << SQI_XCON4_INIT2CMD1_Pos)) /* Assignment of value for INIT2CMD1 in the SQI_XCON4 register */
#define SQI_XCON4_INIT2CMD2_Pos               _UINT32_(8)                                          /* (SQI_XCON4) 8bit SPI Init2 Code2 value Position */
#define SQI_XCON4_INIT2CMD2_Msk               (_UINT32_(0xFF) << SQI_XCON4_INIT2CMD2_Pos)          /* (SQI_XCON4) 8bit SPI Init2 Code2 value Mask */
#define SQI_XCON4_INIT2CMD2(value)            (SQI_XCON4_INIT2CMD2_Msk & (_UINT32_(value) << SQI_XCON4_INIT2CMD2_Pos)) /* Assignment of value for INIT2CMD2 in the SQI_XCON4 register */
#define SQI_XCON4_INIT2CMD3_Pos               _UINT32_(16)                                         /* (SQI_XCON4) 8bit SPI Init2 Code3 value Position */
#define SQI_XCON4_INIT2CMD3_Msk               (_UINT32_(0xFF) << SQI_XCON4_INIT2CMD3_Pos)          /* (SQI_XCON4) 8bit SPI Init2 Code3 value Mask */
#define SQI_XCON4_INIT2CMD3(value)            (SQI_XCON4_INIT2CMD3_Msk & (_UINT32_(value) << SQI_XCON4_INIT2CMD3_Pos)) /* Assignment of value for INIT2CMD3 in the SQI_XCON4 register */
#define SQI_XCON4_INIT2TYPE_Pos               _UINT32_(24)                                         /* (SQI_XCON4) SPI TYPE INIT2:  00 - Single lane mode. 01 - Dual lane mode. 10 - Quad lane mode. 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT2 Code in 1/2/4 lane. Position */
#define SQI_XCON4_INIT2TYPE_Msk               (_UINT32_(0x3) << SQI_XCON4_INIT2TYPE_Pos)           /* (SQI_XCON4) SPI TYPE INIT2:  00 - Single lane mode. 01 - Dual lane mode. 10 - Quad lane mode. 11 - Reserved for Future use. Based on this field, the boot controller will send the INIT2 Code in 1/2/4 lane. Mask */
#define SQI_XCON4_INIT2TYPE(value)            (SQI_XCON4_INIT2TYPE_Msk & (_UINT32_(value) << SQI_XCON4_INIT2TYPE_Pos)) /* Assignment of value for INIT2TYPE in the SQI_XCON4 register */
#define SQI_XCON4_INIT2COUNT_Pos              _UINT32_(26)                                         /* (SQI_XCON4) 2bit SPI INIT2 Count. Indicates whether 1, 2 or 3 bytes of INIT2 Code value are being sent. Position */
#define SQI_XCON4_INIT2COUNT_Msk              (_UINT32_(0x3) << SQI_XCON4_INIT2COUNT_Pos)          /* (SQI_XCON4) 2bit SPI INIT2 Count. Indicates whether 1, 2 or 3 bytes of INIT2 Code value are being sent. Mask */
#define SQI_XCON4_INIT2COUNT(value)           (SQI_XCON4_INIT2COUNT_Msk & (_UINT32_(value) << SQI_XCON4_INIT2COUNT_Pos)) /* Assignment of value for INIT2COUNT in the SQI_XCON4 register */
#define SQI_XCON4_INIT2SCHECK_Pos             _UINT32_(28)                                         /* (SQI_XCON4) SPI Init2 Status Check: 0 - do not check status 1 - check status If this bit is set to 1, the hardware will issue the status command automatically after thecurrent operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status  Control Reg (@0x60) Position */
#define SQI_XCON4_INIT2SCHECK_Msk             (_UINT32_(0x1) << SQI_XCON4_INIT2SCHECK_Pos)         /* (SQI_XCON4) SPI Init2 Status Check: 0 - do not check status 1 - check status If this bit is set to 1, the hardware will issue the status command automatically after thecurrent operation and wait for busy bit to clear. The hardware will issue the next command only after this Status check phase. Note: The Status Command will be formed according to the settings in the SPI Status  Control Reg (@0x60) Mask */
#define SQI_XCON4_INIT2SCHECK(value)          (SQI_XCON4_INIT2SCHECK_Msk & (_UINT32_(value) << SQI_XCON4_INIT2SCHECK_Pos)) /* Assignment of value for INIT2SCHECK in the SQI_XCON4 register */
#define SQI_XCON4_Msk                         _UINT32_(0x1FFFFFFF)                                 /* (SQI_XCON4) Register Mask  */


